src/Documents/НачислениеПоОкладу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеПоОкладу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.Зарплата</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CalculationRegisters/Зарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>Зарплата</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.Календарь</Schedule>
			<ScheduleValue>InformationRegister.Календарь.Resource.РабочийДень</ScheduleValue>
			<ScheduleDate>InformationRegister.Календарь.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.НачисленияУдержания</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/Documents/НачислениеПоОкладу/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Зарплата
	Движения.Зарплата.Записывать = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	НачислениеПоОкладуСотрудники.Сотрудник КАК Сотрудник,
		|	НачислениеПоОкладуСотрудники.Сотрудник.Оклад КАК Оклад
		|ИЗ
		|	Документ.НачислениеПоОкладу.Сотрудники КАК НачислениеПоОкладуСотрудники
		|ГДЕ
		|	НачислениеПоОкладуСотрудники.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Показатель = Выборка.Оклад;
		Движение.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ОплатаПоОкладу;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
	Для каждого Движение Из Движения.Зарплата Цикл
		
		Отбор = Новый Структура("Регистратор, Сотрудник", Ссылка, Движение.Сотрудник);
		
		Норма = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, ВидПериодаРегистраРасчета.ПериодДействия)[0].РабочийДень;
		Факт = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].РабочийДень;
		
		Движение.Сумма = ?(Норма = 0, 0, Движение.Показатель * Факт / Норма);
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
	
КонецПроцедуры
